Revit 2024 API
SolidOptions Members
The SolidOptions type exposes the following members.
Constructors
Name | Description
SolidOptions
 Creates a new SolidOptions class with material and graphics style settings.
Methods
Name | Description
Dispose
Releases all resources used by the SolidOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ExtraFaceAndEdgeHistoryKey
 Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
GraphicsStyleId
 Defines the graphics style id for the Solid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 Defines the material id for the Solid.
See Also
SolidOptions Class
Autodesk.Revit.DB Namespace